# Написать программу, которая будет выводить приветствие с именем
user_name = "Valeria"
print("Hello, " + user_name)