# Написать программу, которая посчитает и выведет результат выражения
# Проверить, является ли результат выражения типом данных int
user_string = ((2 ** 5) * 2 - 16 * 2) / (8 ** 8)
print(user_string)
print(user_string is int)
